Repository: Cripto-cracia/criptocracia-app
Catalog: lib/l10n/app_*.arb
Languages: es

# appSubtitle
source: Trustless Electronic Voting
es: Votación Electrónica sin Confianza

# navElections
source: Elections
es: Elecciones

# navResults
source: Results
es: Resultados

# navAccount
source: Account
es: Cuenta

# navAbout
source: About
es: Acerca de

# selectElectionToViewResults
source: Select an election to view results
es: Selecciona una elección para ver los resultados

source: Debug Info
es: Info de Depuración

source: Debug Information
es: Información de Depuración

# relayUrlDebug
source: Relay URLs: {url}
es: URLs de Relays: {url}

# ecPublicKey
source: EC Public Key: {key}
es: Clave Pública EC: {key}

# debugMode
source: Debug Mode: {mode}
es: Modo Depuración: {mode}

# configured
source: Configured: {status}
es: Configurado: {status}

source: Close
es: Cerrar

# aboutDescription
source: A trustless electronic voting system using blind RSA signatures and the Nostr protocol.
es: Un sistema de votación electrónica sin confianza que utiliza firmas RSA ciegas y el protocolo Nostr.

source: Features:
es: Características:

# featureAnonymous
source: • Anonymous voting with cryptographic proofs
es: • Votación anónima con pruebas criptográficas

# featureRealtime
source: • Real-time results via Nostr
es: • Resultados en tiempo real vía Nostr

# featureDecentralized
source: • Decentralized vote collection
es: • Recolección descentralizada de votos

# featureTamperEvident
source: • Tamper-evident vote counting
es: • Conteo de votos a prueba de manipulación

source: Retry
es: Reintentar

source: No Elections Found
es: No se Encontraron Elecciones

# noActiveElectionsFound
source: No active elections were found on the Nostr relay in the last 24 hours.
es: No se encontraron elecciones activas en el relay Nostr en las últimas 24 horas.

# electionStartLabel
source: Start: {time}
es: Inicio: {time}

# electionEndLabel
source: End: {time}
es: Fin: {time}

source: Candidates ({count})
es: Candidatos ({count})

# candidatesCountShort
source: {count, plural, =0{No candidates} =1{1 candidate} other{{count} candidates}}
es: {count, plural, =0{No hay candidatos} =1{1 candidato} other{{count} candidatos}}

# noCandidatesForElection
source: No candidates available for this election.
es: No hay candidatos disponibles para esta elección.

# statusOpen
source: Open
es: Abierta

# statusInProgress
source: In Progress
es: En Progreso

# statusFinished
source: Finished
es: Finalizada

# statusCanceled
source: Canceled
es: Cancelada

source: Cast Vote
es: Emitir Voto

# electionSection
source: Election
es: Elección

# yourChoiceSection
source: Your Choice
es: Tu Elección

# votingProcessSection
source: Voting Process
es: Proceso de Votación

# generateNonceStep
source: Generate Nonce
es: Generar Nonce

# sendBlindedNonceStep
source: Send Blinded Nonce
es: Enviar Nonce Ciego

# waitForSignatureStep
source: Wait for Signature
es: Esperar Firma

# voteCompleteStep
source: Vote Complete
es: Voto Completo

source: Start Voting Process
es: Iniciar Proceso de Votación

# voteCastSuccess
source: Vote Cast Successfully!
es: ¡Voto Emitido Exitosamente!

# voteRecordedMessage
source: Your vote has been recorded anonymously.
es: Tu voto ha sido registrado anónimamente.

source: Return to Elections
es: Volver a Elecciones

# electionResultsTitle
source: {name} - Results
es: {name} - Resultados

# pauseUpdatesTooltip
source: Pause Updates
es: Pausar Actualizaciones

# resumeUpdatesTooltip
source: Resume Updates
es: Reanudar Actualizaciones

# electionSummarySection
source: Election Summary
es: Resumen

# totalVotesLabel
source: Total Votes
es: Total de Votos

# candidatesLabel
source: Candidates
es: Candidatos

# statusLabel
source: Status
es: Estado

# liveStatus
source: Live
es: En Vivo

# pausedStatus
source: Paused
es: Pausado

# resultsSection
source: Results
es: Resultados

source: No votes recorded yet
es: Aún no se han registrado votos

# timeFormatJustNow
source: Just now
es: Justo ahora

# timeFormatMinutesAgo
source: {minutes, plural, =1{1 min ago} other{# min ago}}
es: {minutes, plural, =1{hace 1 min} other{hace # min}}

# timeFormatHoursAgo
source: {hours, plural, =1{1h ago} other{#h ago}}
es: {hours, plural, =1{hace 1h} other{hace #h}}

# lastUpdatedLabel
source: Last updated: {time}
es: Última actualización: {time}

source: Account
es: Cuenta

source: Error loading keys
es: Error al cargar las claves

source: No keys available
es: No hay claves disponibles

source: Nostr Identity
es: Identidad Nostr

# nostrIdentityDescription
source: Your Nostr identity is derived from your seed phrase using the derivation path: {path}
es: Tu identidad Nostr se deriva de tu frase semilla usando la ruta de derivación: {path}

source: Public Key (npub)
es: Clave Pública (npub)

# publicKeyDescription
source: Your Nostr public identifier
es: Tu identificador público Nostr

source: Seed Phrase
es: Frase Semilla

# seedPhraseDescription
source: Your recovery mnemonic (keep this secure!)
es: Tu mnemónico de recuperación (¡manténlo seguro!)

# copiedToClipboard
source: {label} copied to clipboard
es: {label} copiado al portapapeles

source: Advanced
es: Avanzado

source: Regenerate Keys
es: Regenerar Claves

# regenerateKeysDescription
source: Generate new seed phrase (will lose current identity)
es: Generar nueva frase semilla (perderás la identidad actual)

source: About NIP-06
es: Acerca de NIP-06

# aboutNip06Description
source: Learn about Nostr key derivation
es: Aprende sobre la derivación de claves Nostr

source: Security Warning
es: Advertencia de Seguridad

# securityWarningText
source: Your seed phrase is your master key. Never share it with anyone. If you lose it, you cannot recover your identity. Store it safely offline.
es: Tu frase semilla es tu clave maestra. Nunca la compartas con nadie. Si la pierdes, no podrás recuperar tu identidad. Guárdala de forma segura sin conexión.

# nip06Description
source: NIP-06 defines how to derive Nostr keys from a mnemonic seed phrase.
es: NIP-06 define cómo derivar claves Nostr desde una frase semilla mnemónica.

# derivationPath
source: Derivation Path: m/44'/1237'/1989'/0/0
es: Ruta de Derivación: m/44'/1237'/1989'/0/0

# derivationPathBip44
source: • 44': BIP44 standard
es: • 44': Estándar BIP44

# derivationPathCoinType
source: • 1237': Nostr coin type
es: • 1237': Tipo de moneda Nostr

# derivationPathAccount
source: • 1989': Account index
es: • 1989': Índice de cuenta

# derivationPathChange
source: • 0: Change (external)
es: • 0: Cambio (externo)

# derivationPathAddress
source: • 0: Address index
es: • 0: Índice de dirección

# nip06Compatibility
source: This ensures compatibility with other Nostr clients that follow NIP-06.
es: Esto asegura compatibilidad con otros clientes Nostr que siguen NIP-06.

# regenerateKeysConfirmation
source: This will generate a new seed phrase and delete your current identity. This action cannot be undone. Are you sure?
es: Esto generará una nueva frase semilla y eliminará tu identidad actual. Esta acción no se puede deshacer. ¿Estás seguro?

source: Cancel
es: Cancelar

source: Regenerate
es: Regenerar

# newKeysGenerated
source: New keys generated successfully
es: Nuevas claves generadas exitosamente

source: Import Seed Phrase
es: Importar Frase Semilla

# importSeedPhraseDescription
source: Import an existing seed phrase to restore your identity
es: Importa una frase semilla existente para restaurar tu identidad

# enterSeedPhrase
source: Enter your seed phrase
es: Ingresa tu frase semilla

# seedPhraseHint
source: Enter 12 or 24 words separated by spaces
es: Ingresa 12 o 24 palabras separadas por espacios

# importButton
source: Import
es: Importar

source: Import Seed Phrase Warning
es: Advertencia de Importación de Frase Semilla

# importWarningMessage
source: Importing a new seed phrase will replace your current identity. If your current seed phrase is not backed up, it will be lost forever. This action cannot be undone.
es: Importar una nueva frase semilla reemplazará tu identidad actual. Si tu frase semilla actual no está respaldada, se perderá para siempre. Esta acción no se puede deshacer.

source: Continue Import
es: Continuar Importación

# invalidSeedPhrase
source: Invalid seed phrase. Please check your words and try again.
es: Frase semilla inválida. Por favor revisa las palabras e intenta de nuevo.

source: Seed phrase imported successfully!
es: ¡Frase semilla importada exitosamente!

# votesCount
source: {count} votes
es: {count} votos

source: Vote
es: Votar

# votesLabel
source: votes
es: votos

source: Settings
es: Configuración

source: Relay Management
es: Gestión de Relays

# relayManagementDescription
source: Manage your Nostr relay connections for enhanced reliability and performance.
es: Gestiona tus conexiones de relays Nostr para mayor confiabilidad y rendimiento.

source: Add Relay
es: Agregar Relay

source: Edit Relay
es: Editar Relay

source: Delete Relay
es: Eliminar Relay

source: Relay URL
es: URL del Relay

# statusConnected
source: Connected
es: Conectado

# statusDisconnected
source: Disconnected
es: Desconectado

# statusUnknown
source: Unknown
es: Desconocido

# lastSeenJustNow
source: Just now
es: Justo ahora

# lastSeenMinutesAgo
source: {minutes}m ago
es: hace {minutes}m

# lastSeenHoursAgo
source: {hours}h ago
es: hace {hours}h

source: Refresh Relay Statuses
es: Actualizar Estados de Relays

source: Relay statuses refreshed
es: Estados de relays actualizados

source: Error refreshing statuses
es: Error al actualizar estados

# relayAdded
source: Relay added successfully
es: Relay agregado exitosamente

source: Failed to add relay
es: Error al agregar relay

# relayUpdated
source: Relay updated successfully
es: Relay actualizado exitosamente

source: Failed to update relay
es: Error al actualizar relay

# relayDeleted
source: Relay deleted successfully
es: Relay eliminado exitosamente

source: Failed to delete relay
es: Error al eliminar relay

# confirmDeleteRelay
source: Delete Relay
es: Eliminar Relay

# deleteRelayConfirmation
source: Are you sure you want to delete the relay '{url}'?
es: ¿Estás seguro de que quieres eliminar el relay '{url}'?

source: Add
es: Agregar

source: Update
es: Actualizar

source: Delete
es: Eliminar

# ecPublicKeyTitle
source: Election Commission Public Key
es: Clave Pública de la Comisión Electoral

# ecPublicKeyDescription
source: The public key of the Election Commission used for vote validation and blind signature verification.
es: La clave pública de la Comisión Electoral utilizada para la validación de votos y verificación de firmas ciegas.

# ecPublicKeyLabel
source: EC Public Key
es: Clave Pública EC

# ecPublicKeyHint
source: 64-character hexadecimal key
es: Clave hexadecimal de 64 caracteres

source: Save EC Key
es: Guardar Clave EC

# ecKeyUpdatedSuccessfully
source: EC public key updated successfully
es: Clave pública EC actualizada exitosamente

# invalidEcKeyFormat
source: Invalid EC public key format
es: Formato de clave pública EC inválido

# connectionStats
source: Connection Statistics
es: Estadísticas de Conexión

# connectedRelays
source: Connected
es: Conectados

# disconnectedRelays
source: Disconnected
es: Desconectados

# versionInfo
source: Version Information
es: Información de Versión

source: App Version
es: Versión de la App

source: Git Commit
es: Commit de Git

source: Initialization Error
es: Error de Inicialización

source: Critical initialization error:
es: Error crítico de inicialización:

# tokenRequestTimeout
source: ⏰ Token request timeout. The Election Coordinator may be unavailable.
es: ⏰ Timeout de solicitud de token. El Coordinador Electoral puede no estar disponible.

# voteTokenReceived
source: ✅ You are now eligible to vote! Now just wait for the voting to start.
es: ✅ ¡Token de voto recibido! Ya puedes votar.

# requestingVoteToken
source: Requesting vote token... Please wait.
es: Solicitando token de voto... Por favor espera.

# needVoteTokenInstruction
source: You need to request a vote token first by selecting this election from the elections list.
es: Necesitas solicitar un token de voto primero seleccionando esta elección de la lista de elecciones.

source: Sending Vote...
es: Enviando Voto...

source: Clear Selection
es: Limpiar Selección

source: Vote Token Required
es: Token de Voto Requerido

# voteTokenInstructions
source: You need a vote token to cast your vote.
es: Necesitas un token de voto para emitir tu voto.

source: Go to Elections
es: Ir a Elecciones

source: Election Not Started
es: Elección No Iniciada

# votingPeriodNotStarted
source: The voting period for this election has not started yet.
es: El período de votación para esta elección aún no ha comenzado.

# canSelectCandidateNow
source: You can select your candidate now and vote when the election starts.
es: Puedes seleccionar tu candidato ahora y votar cuando comience la elección.

source: Confirm Vote
es: Confirmar Voto

# aboutToVoteFor
source: You are about to vote for:
es: Estás a punto de votar por:

source: Important Warning
es: Advertencia Importante

# voteIrreversible
source: • Your vote is irreversible and cannot be changed
es: • Tu voto es irreversible y no se puede cambiar

# voteAnonymous
source: • Your vote will be anonymous and cryptographically secured
es: • Tu voto será anónimo y criptográficamente seguro

# oneVotePerElection
source: • You can only vote once per election
es: • Solo puedes votar una vez por elección

source: No Election Results Yet
es: Aún No Hay Resultados Electorales

# resultsWillAppearHere
source: Results will appear here when the Election Coordinator publishes vote counts for elections.
es: Los resultados aparecerán aquí cuando el Coordinador Electoral publique los recuentos de votos para las elecciones.

# voteDisplayFormat
source: {votes} votes ({percentage}%)
es: {votes} votos ({percentage}%)

source: Winner
es: Ganador

source: Leading
es: Liderando

# relayUrlPlaceholder
source: wss://relay.example.com
es: wss://relay.ejemplo.com

source: Refresh
es: Actualizar

source: Election Results
es: Resultados Electorales
